namespace HomeWork2_OOP
{
    public class Program
    {
        //Завдання 1 (ООП)
        //Запрограмуйте клас Money(об'єкт класу оперує однією валютою) для роботи з грошима. 
        //У класі мають бути передбачені: поле для зберігання цілої частини грошей (долари, євро, гривні тощо) і поле для зберігання копійок (центи, євроценти, копійки тощо)
        //Реалізувати методи виведення суми на екран, задання значень частин
        //(цілої частини грошей та копійок). 
        //На базі класу Money створити клас Product для роботи з продуктом або товаром.
        //Реалізувати метод, який дозволяє зменшити ціну на задане число.
        //Для кожного з класів реалізувати необхідні методи і поля. 
        //Додати iнкапсуляцiю до полiв та методiв якщо треба.

        public static void Main()
        {
            // Задаем товар и цену
            var price = new Money(Money.Currency.USD, 1000, 25); 
            var product = new Product("Laptop", price);

            // Выводим товар
            Console.WriteLine(product.ToString());

            // Применяем скидку
            var discount = new Money(Money.Currency.USD, 100, 250);
            product.Discount(discount);

            // Выводим товар со скидкой
            Console.WriteLine(product.ToString());

            Console.ReadKey();
        }
    }
}

